Samraksh/eMote/MicroFrameworkPK_v4_3/DeviceCode/Targets/Native/STM32F10x/DeviceCode/drivers/pwr/netmf_pwr.cpp

/*

STM32F1x Microframework power HAL driver

Nathan Stohs
nathan.stohs@samraksh.com

*/

#include "netmf_pwr.h"
#include "netmf_pwr_wakelock.h"
#include "../usart/sam_usart.h"
#include "../Timer/netmf_rtc/netmf_rtc.h"

//#undef POWER_PROFILE_HACK

#ifdef POWER_PROFILE_HACK
//#define POWER_PROFILE_RTC_WARN
//#define POWER_TABLE_WRAP

#define FILTER_WAKELOCK_DENY
#define FILTER_LOCKON
#define FILTER_LOCKOFF
//#define FILTER_TOO_SHORT
//#define FILTER_SNOOZE
#define FILTER_USART

#define POWER_EVENTS_SIZE 64
#define POWER_COUNT_INIT -48

static IRQn_Type get_first_irq(void);

typedef enum __attribute__ ((packed)) {
	GOING_TO_SLEEP,
	WAKEUP,
	TOO_SHORT,
	WAKELOCK_ON,
	WAKELOCK_OFF,
	WAKELOCK_DENY,
	TIMEWARP,
	SNOOZE,
	BUSY_ISR,
	BUSY_USART,
} power_event_enum_t;

typedef struct __attribute__ ((packed)) {
	uint32_t time;
	uint16_t data16;
	//int8_t misc1;
	power_event_enum_t evt;
} power_event_t;

static power_event_t power_events[POWER_EVENTS_SIZE];
static int power_count = POWER_COUNT_INIT;

static const char* power_evt_to_string(power_event_enum_t x) {
	switch (x) {
		case GOING_TO_SLEEP:	return "SLEEP";
		case WAKEUP:			return "WAKEUP";
		case TOO_SHORT: 		return "TOO_SHORT";
		case WAKELOCK_ON: 		return "LOCK_ON";
		case WAKELOCK_OFF: 		return "LOCK_OFF";
		case WAKELOCK_DENY: 	return "WAKELOCK_DENY";
		case TIMEWARP: 			return "TIMEWARP";
		case SNOOZE:			return "SNOOZE";
		case BUSY_ISR:			return "BUSY_ISR";
		case BUSY_USART:		return "BUSY_USART";
		default:				return "UNKNOWN";
	}
}

static void print_power_event(power_event_t e) {
	hal_printf("%d %d %s 0\r\n", e.time, e.data16, power_evt_to_string(e.evt) /*, e.misc1*/);
}

// Only do this on wakeup for known state
static void print_all_power_events() {
	//TIM_Cmd(TIM1, DISABLE);
	//SOFT_BREAKPOINT();
	__enable_irq();
	for(int i=0; i<POWER_EVENTS_SIZE; i++) {
		print_power_event(power_events[i]);
	}
	hal_printf("%d\r\n", RTC_GetCounter());
	while(1); // never return;
}

static void power_event_sleep(uint32_t now, uint16_t wakeup, enum stm_power_modes power_state) {
	if (power_count < 0) { power_count++; return; }
	if (power_count >= POWER_EVENTS_SIZE) { return; }
	power_events[power_count].time = now;
	power_events[power_count].data16 = wakeup;
	power_events[power_count].evt = GOING_TO_SLEEP;

	// int8_t misc1;
	// switch(power_state) {
		// case POWER_STATE_DEFAULT: 		misc1 = 0; break;
		// case POWER_STATE_LOW:			misc1 = 1; break;
		// case POWER_STATE_MID:			misc1 = 2; break;
		// case POWER_STATE_HIGH:			misc1 = 3; break;
		// case POWER_STATE_GOING_SLEEP:	misc1 = 4; break;
		// default:						misc1 = 5; break;
	// }
	// power_events[power_count].misc1 = misc1;
	power_count++;
#ifdef POWER_TABLE_WRAP
	if (power_count >= POWER_EVENTS_SIZE)
		power_count=0;
#endif
}

static void power_event_add(uint32_t now, power_event_enum_t evt, uint16_t data16, int8_t extra) {
	if (power_count < 0 || power_count >= POWER_EVENTS_SIZE) { return; }
	if (power_count >= POWER_EVENTS_SIZE) { print_all_power_events(); return; }
	
	switch (evt) {
#ifdef FILTER_WAKELOCK_DENY
		case WAKELOCK_DENY:
#endif
#ifdef FILTER_LOCKOFF
		case WAKELOCK_OFF:
#endif
#ifdef FILTER_LOCKON
		case WAKELOCK_ON:
#endif
#ifdef FILTER_TOO_SHORT
		case TOO_SHORT:
#endif
#ifdef FILTER_SNOOZE
		case SNOOZE:
#endif
#ifdef FILTER_USART
		case BUSY_USART:
#endif
		return;
		default: break;
	}

	power_events[power_count].time = now;
	power_events[power_count].data16 = data16;
	power_events[power_count].evt = evt;
	//power_events[power_count].misc1 = extra;
	power_count++;
#ifdef POWER_TABLE_WRAP
	if (power_count >= POWER_EVENTS_SIZE)
		power_count=0;
#endif
}

static void power_event_wakeup(uint32_t now) {
	if (power_count < 0) { power_count++; return; }
	if (power_count >= POWER_EVENTS_SIZE) { print_all_power_events(); return; }
	power_events[power_count].time = now;
	power_events[power_count].evt = WAKEUP;
	power_events[power_count].data16 = (uint16_t)get_first_irq();
	power_count++;
#ifdef POWER_TABLE_WRAP
	if (power_count >= POWER_EVENTS_SIZE)
		power_count=0;
#endif
}

#endif

#ifdef POWER_PROFILE_RTC_WARN
#define POWER_DEBUG_WAKEUP (8*32768) // Dump debug if we don't wakeup for X seconds.
#define POWER_DEBUG_WAKEUP_OFFSET (32768*60*15) // 15 minutes
static uint32_t startup_time;
static uint32_t debug_wakeup = 0xFFFFFFFF;
static HAL_CONTINUATION power_debug_continuation;
static void power_debug_dump(void *arg) {
	hal_printf("Power Debug Watchdog: %d seconds passed without sleep\r\n", POWER_DEBUG_WAKEUP/32768);
	SOFT_BREAKPOINT();
}
#endif

// Number of RTC ticks it takes to wakeup from each power level.
// So wakeup early by this amount plus some slop
// enum wakeup_ticks{
	// MIN_SLEEP_TICKS = 33,
	// SLEEP_EXTRA_PAD = 2,
	// SLEEP_PADDING_HIGH_POWER = 9,
	// SLEEP_PADDING_MID_POWER = 9,
	// SLEEP_PADDING_LOW_POWER = 6,
// };
enum wakeup_ticks{
	MIN_SLEEP_TICKS = 17,
	SLEEP_EXTRA_PAD = 2,
	SLEEP_PADDING_HIGH_POWER = 5,
	SLEEP_PADDING_MID_POWER = 5,
	SLEEP_PADDING_LOW_POWER = 3,
};

#ifdef PLATFORM_ARM_AUSTERE
#include <stm32f10x.h>
#endif

static int pwr_hsi_clock_measure;
static int pwr_hsi_clock_measure_orig;
static enum stm_power_modes stm_power_state = POWER_STATE_DEFAULT;

#ifdef PLATFORM_ARM_AUSTERE
static void power_supply_reset() {
  GPIO_InitTypeDef GPIO_InitStructure;
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6 | GPIO_Pin_11 | GPIO_Pin_13; // leave out PC8 due to schematic issues
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPD;
  GPIO_Init(GPIOC, &GPIO_InitStructure);

  // Configure Inputs
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_7 | GPIO_Pin_12;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU; //
  GPIO_Init(GPIOC, &GPIO_InitStructure);

  // Configure Inputs
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_5;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU; // PB5 is open-drain from LTC3103
  GPIO_Init(GPIOB, &GPIO_InitStructure);

  // Configure Inputs
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
  GPIO_Init(GPIOC, &GPIO_InitStructure);

